==================
Ability: Valid: %{c|a}
==================
%{c|a}
---
(roll20_script
	(ability
		(characterName)
		(abilityName)))

==================
Ability: Valid: %{selected|a}
==================
%{selected|a}
---
(roll20_script
	(ability
		(token)
		(abilityName)))

==================
Ability: Valid: %{target|a}
==================
%{target|a}
---
(roll20_script
	(ability
		(token)
		(abilityName)))

==================
Ability: Invalid: %{}
==================
%{}
---
(roll20_script
 	(invalid))

==================
Ability: Invalid: %{|}
==================
%{|}
---
(roll20_script
	(ability
		(invalid)))

==================
Ability: Invalid: %{||}
==================
%{||}
---
(roll20_script
	(ability
		(invalid)))

==================
Ability: Invalid: %{c|}
==================
%{c|}
---
(roll20_script
	(ability
		(characterName)
		(invalid)))

==================
Ability: Invalid: %{|a}
==================
%{|a}
---
(roll20_script
	(ability
		(invalid)))

==================
Ability: Invalid: %{c||}
==================
%{c||}
---
(roll20_script
	(ability
		(characterName)
		(invalid)))

==================
Ability: Invalid: %{|a|}
==================
%{|a|}
---
(roll20_script
	(ability
		(invalid)))

==================
Ability: Invalid: %{c|a|}
==================
%{c|a|}
---
(roll20_script
	(ability
		(characterName)
		(invalid)))

==================
Ability w/o closing brace: Invalid: %{c
==================
%{c
---
(roll20_script
	(invalid))

==================
Ability w/o closing brace: Invalid: %{c|
==================
%{c|
---
(roll20_script
	(invalid))

==================
Ability w/o closing brace: Invalid: %{c|a
==================
%{c|a
---
(roll20_script
	(invalid))

==================
Ability w/ Attribute character sequence: Invalid: %{x@{y}
==================
%{x@{y}
---
(roll20_script
	(invalid)
	(attribute
		(attributeName)))

==================
Ability w/ Attribute character sequence: Invalid: %{x@{y}z
==================
%{x@{y}z
---
(roll20_script
	(invalid)
	(attribute
		(attributeName)))

==================
Ability w/ Attribute character sequence: Invalid: %{x@{y}z}
==================
%{x@{y}z}
---
(roll20_script
	(invalid)
	(attribute
		(attributeName)))

==================
Ability w/ Attribute character sequence: Invalid: %{x@{y}|
==================
%{x@{y}|
---
(roll20_script
	(invalid)
	(attribute
		(attributeName)))

==================
Ability w/ Attribute character sequence: Invalid: %{x@{y}|z
==================
%{x@{y}|z
---
(roll20_script
	(invalid)
	(attribute
		(attributeName)))

==================
Ability w/ Attribute character sequence: Invalid: %{x@{y}|z}
==================
%{x@{y}|z}
---
(roll20_script
	(invalid)
	(attribute
		(attributeName)))

