==================
Inline Roll: [[5]]
==================
[[5]]
---
(script
	(inlineRoll (formula
		(term
			(number)
		)
	)))

==================
Inline Roll: [[ 5 ]]
==================
[[ 5 ]]
---
(script
	(inlineRoll (formula
		(term
			(number)
		)
	)))






==================
Inline Roll: [[-5]]
==================
[[-5]]
---
(script
	(inlineRoll (formula
		(term
			(operator)
			(number)
		)
	)))

==================
Inline Roll: [[ -5 ]]
==================
[[ -5 ]]
---
(script
	(inlineRoll (formula
		(term
			(operator)
			(number)
		)
	)))

==================
Inline Roll: [[+5]]
==================
[[+5]]
---
(script
	(inlineRoll (formula
		(term
			(operator)
			(number)
		)
	)))






==================
Inline Roll: [[1-5]]
==================
[[1-5]]
---
(script
	(inlineRoll (formula
		(term
			(number)
		)
		(operator)
		(term
			(number)
		)
	)))

==================
Inline Roll: [[1 - 5]]
==================
[[1 - 5]]
---
(script
	(inlineRoll (formula
		(term
			(number)
		)
		(operator)
		(term
			(number)
		)
	)))

==================
Inline Roll: [[1+5]]
==================
[[1+5]]
---
(script
	(inlineRoll (formula
		(term
			(number)
		)
		(operator)
		(term
			(number)
		)
	)))

==================
Inline Roll: [[1 + 5]]
==================
[[1 + 5]]
---
(script
	(inlineRoll (formula
		(term
			(number)
		)
		(operator)
		(term
			(number)
		)
	)))

==================
Inline Roll: [[1*5]]
==================
[[1*5]]
---
(script
	(inlineRoll (formula
		(term
			(number)
		)
		(operator)
		(term
			(number)
		)
	)))

==================
Inline Roll: [[1 * 5]]
==================
[[1 * 5]]
---
(script
	(inlineRoll (formula
		(term
			(number)
		)
		(operator)
		(term
			(number)
		)
	)))

==================
Inline Roll: [[1**5]]
==================
[[1**5]]
---
(script
	(inlineRoll (formula
		(term
			(number)
		)
		(operator)
		(term
			(number)
		)
	)))

==================
Inline Roll: [[1 ** 5]]
==================
[[1 ** 5]]
---
(script
	(inlineRoll (formula
		(term
			(number)
		)
		(operator)
		(term
			(number)
		)
	)))

==================
Inline Roll: [[1/5]]
==================
[[1/5]]
---
(script
	(inlineRoll (formula
		(term
			(number)
		)
		(operator)
		(term
			(number)
		)
	)))

==================
Inline Roll: [[1 / 5]]
==================
[[1 / 5]]
---
(script
	(inlineRoll (formula
		(term
			(number)
		)
		(operator)
		(term
			(number)
		)
	)))

==================
Inline Roll: [[1%5]]
==================
[[1%5]]
---
(script
	(inlineRoll (formula
		(term
			(number)
		)
		(operator)
		(term
			(number)
		)
	)))

==================
Inline Roll: [[1 % 5]]
==================
[[1 % 5]]
---
(script
	(inlineRoll (formula
		(term
			(number)
		)
		(operator)
		(term
			(number)
		)
	)))

==================
Inline Roll: [[1+-5]]
==================
[[1+-5]]
---
(script
	(inlineRoll (formula
		(term
			(number)
		)
		(operator)
		(term
			(number)
		)
	)))

==================
Inline Roll: [[1 + - 5]]
==================
[[1 + - 5]]
---
(script
	(inlineRoll (formula
		(term
			(number)
		)
		(operator)
		(term
			(number)
		)
	)))

==================
Inline Roll: [[1-+5]]
==================
[[1-+5]]
---
(script
	(inlineRoll (formula
		(term
			(number)
		)
		(operator)
		(term
			(number)
		)
	)))

==================
Inline Roll: [[1 - + 5]]
==================
[[1 - + 5]]
---
(script
	(inlineRoll (formula
		(term
			(number)
		)
		(operator)
		(term
			(number)
		)
	)))

==================
Inline Roll: [[1+-+5]]
==================
[[1+-+5]]
---
(script
	(inlineRoll (formula
		(term
			(number)
		)
		(operator)
		(term
			(number)
		)
	)))

==================
Inline Roll: [[1-+-5]]
==================
[[1-+-5]]
---
(script
	(inlineRoll (formula
		(term
			(number)
		)
		(operator)
		(term
			(number)
		)
	)))

==================
Inline Roll: [[1+ - + -+ -+-5]]
==================
[[1+ - + -+ -+-5]]
---
(script
	(inlineRoll (formula
		(term
			(number)
		)
		(operator)
		(term
			(number)
		)
	)))

==================
Inline Roll: [[1 / + - + -+ -+-5]]
==================
[[1 / + - + -+ -+-5]]
---
(script
	(inlineRoll (formula
		(term
			(number)
		)
		(operator)
		(term
			(operator)
			(number)
		)
	)))






==================
Inline Roll: [[@{a}]]
==================
[[@{a}]]
---
(script
	(inlineRoll (formula
		(term
			(number
				(attribute
					(identifier)))
		)
	)))

==================
Inline Roll: [[ @{a} ]]
==================
[[ @{a} ]]
---
(script
	(inlineRoll (formula
		(term
			(number
				(attribute
					(identifier)))
		)
	)))

==================
Inline Roll: [[@{c|a}]]
==================
[[@{c|a}]]
---
(script
	(inlineRoll (formula
		(term
			(number
				(attribute
					(identifier)
					(separator)
					(identifier)))
		)
	)))

==================
Inline Roll: [[%{a}]]
==================
[[%{a}]]
---
(script
	(inlineRoll (formula
		(term
			(number
				(ability
					(identifier)))
		)
	)))

==================
Inline Roll: [[ %{a} ]]
==================
[[ %{a} ]]
---
(script
	(inlineRoll (formula
		(term
			(number
				(ability
					(identifier)))
		)
	)))

==================
Inline Roll: [[%{c|a}]]
==================
[[%{c|a}]]
---
(script
	(inlineRoll (formula
		(term
			(number
				(ability
					(identifier)
					(separator)
					(identifier)))
		)
	)))






==================
Inline Roll: [[#m]]
==================
[[#m]]
---
(script
	(inlineRoll (formula
		(term
			(hash)
		)
	)))

==================
Inline Roll: [[#m ]]
==================
[[#m ]]
---
(script
	(inlineRoll (formula
		(term
			(hash)
		)
	)))

==================
Inline Roll: [[ #m]]
==================
[[ #m]]
---
(script
	(inlineRoll (formula
		(term
			(hash)
		)
	)))

==================
Inline Roll: [[ #m ]]
==================
[[ #m ]]
---
(script
	(inlineRoll (formula
		(term
			(hash)
		)
	)))

==================
Inline Roll: [[#m ]]@{a}]]
==================
[[#m ]]@{a}]]
---
(script
	(inlineRoll (formula
		(term
			(hash)
		)
	))
	(attribute
		(identifier)))

==================
Inline Roll: [[#m]]@{a}]]
==================
[[#m]]@{a}]]
---
(script
	(inlineRoll (formula
		(term
			(hash)
		)
	))
	(attribute
		(identifier)))

==================
Inline Roll: [[5#m ]]
==================
[[5#m ]]
---
(script
	(inlineRoll (formula
		(term
			(number)
			(hash)
		)
	)))






==================
Inline Roll: [[ [[5]] ]]
==================
[[ [[5]] ]]
---
(script
	(inlineRoll (formula
		(term
			(number
				(inlineRoll (formula
					(term
						(number)
					)
				)))
		)
	)))


==================
Inline Roll: [[ @{a}[[5]]%{b} ]]
==================
[[ @{a}[[5]]%{b} ]]
---
(script
	(inlineRoll (formula
		(term
			(number
				(attribute
					(identifier))
				(inlineRoll (formula
					(term
						(number)
					)
				))
				(ability
					(identifier)))
		)
	)))

==================
Inline Roll: [[ -@{a}[[5]]%{b} ]]
==================
[[ -@{a}[[5]]%{b} ]]
---
(script
	(inlineRoll (formula
		(term
			(operator)
			(number
				(attribute
					(identifier))
				(inlineRoll (formula
					(term
						(number)
					)
				))
				(ability
					(identifier)))
		)
	)))

==================
Inline Roll: [[ %{a}%5 ]]
==================
[[ %{a}%5 ]]
---
(script
	(inlineRoll (formula
		(term
			(number
				(ability
					(identifier)))
		)
		(operator)
		(term
			(number)
		)
	)))

==================
Inline Roll: [[ 1 %5%{a} ]]
==================
[[ 1 %5%{a} ]]
---
(script
	(inlineRoll (formula
		(term
			(number)
		)
		(operator)
		(term
			(number
				(ability
					(identifier)))
		)
	)))






==================
Inline Roll Labels: [[ [] 5 ]]
==================
[[ [] 5 ]]
---
(script
	(inlineRoll (formula
		(label)
		(term
			(number)
		)
	)))

==================
Inline Roll Labels: [[ [a] 5 ]]
==================
[[ [a] 5 ]]
---
(script
	(inlineRoll (formula
		(label (literal))
		(term
			(number)
		)
	)))

==================
Inline Roll Labels: [[ 5 [] ]]
==================
[[ 5 [] ]]
---
(script
	(inlineRoll (formula
		(term
			(number)
		)
		(label)
	)))

==================
Inline Roll Labels: [[ 5 [a] ]]
==================
[[ 5 [a] ]]
---
(script
	(inlineRoll (formula
		(term
			(number)
		)
		(label (literal))
	)))

