==================
Number: [[5]]
==================
[[5]]
---
(script
	(inlineRoll
		(delimiter_start)
		(formula
			(term
				(number_constant)))
		(delimiter_end)))

==================
Number: [[ 5 ]]
==================
[[ 5 ]]
---
(script
	(inlineRoll
		(delimiter_start)
		(formula
			(term
				(number_constant)))
		(delimiter_end)))

==================
Number: [[42]]
==================
[[42]]
---
(script
	(inlineRoll
		(delimiter_start)
		(formula
			(term
				(number_constant)))
		(delimiter_end)))

==================
Number: [[ 42 ]]
==================
[[ 42 ]]
---
(script
	(inlineRoll
		(delimiter_start)
		(formula
			(term
				(number_constant)))
		(delimiter_end)))

==================
Number: [[5.5]]
==================
[[5.5]]
---
(script
	(inlineRoll
		(delimiter_start)
		(formula
			(term
				(number_constant)
				(decimal_point)
				(number_constant)))
		(delimiter_end)))

==================
Number: [[ 5.5 ]]
==================
[[ 5.5 ]]
---
(script
	(inlineRoll
		(delimiter_start)
		(formula
			(term
				(number_constant)
				(decimal_point)
				(number_constant)))
		(delimiter_end)))

==================
Number: [[42.42]]
==================
[[42.42]]
---
(script
	(inlineRoll
		(delimiter_start)
		(formula
			(term
				(number_constant)
				(decimal_point)
				(number_constant)))
		(delimiter_end)))

==================
Number: [[ 42.42 ]]
==================
[[ 42.42 ]]
---
(script
	(inlineRoll
		(delimiter_start)
		(formula
			(term
				(number_constant)
				(decimal_point)
				(number_constant)))
		(delimiter_end)))

==================
Number: [[-5]]
==================
[[-5]]
---
(script
	(inlineRoll
		(delimiter_start)
		(formula
			(term
				(operator)
				(number_constant)))
		(delimiter_end)))

==================
Number: [[ -5 ]]
==================
[[ -5 ]]
---
(script
	(inlineRoll
		(delimiter_start)
		(formula
			(term
				(operator)
				(number_constant)))
		(delimiter_end)))

==================
Number: [[-42.42]]
==================
[[-42.42]]
---
(script
	(inlineRoll
		(delimiter_start)
		(formula
			(term
				(operator)
				(number_constant)
				(decimal_point)
				(number_constant)))
		(delimiter_end)))

==================
Number: [[ -42.42 ]]
==================
[[ -42.42 ]]
---
(script
	(inlineRoll
		(delimiter_start)
		(formula
			(term
				(operator)
				(number_constant)
				(decimal_point)
				(number_constant)))
		(delimiter_end)))

==================
Number: [[+5]]
==================
[[+5]]
---
(script
	(inlineRoll
		(delimiter_start)
		(formula
			(term
				(operator)
				(number_constant)))
		(delimiter_end)))

==================
Number: [[ +5 ]]
==================
[[ +5 ]]
---
(script
	(inlineRoll
		(delimiter_start)
		(formula
			(term
				(operator)
				(number_constant)))
		(delimiter_end)))

==================
Number: [[+42.42]]
==================
[[+42.42]]
---
(script
	(inlineRoll
		(delimiter_start)
		(formula
			(term
				(operator)
				(number_constant)
				(decimal_point)
				(number_constant)))
		(delimiter_end)))

==================
Number: [[ +42.42 ]]
==================
[[ +42.42 ]]
---
(script
	(inlineRoll
		(delimiter_start)
		(formula
			(term
				(operator)
				(number_constant)
				(decimal_point)
				(number_constant)))
		(delimiter_end)))

==================
Number: [[.5]]
==================
[[.5]]
---
(script
	(inlineRoll
		(delimiter_start)
		(formula
			(term
				(decimal_point)
				(number_constant)))
		(delimiter_end)))

==================
Number: [[ .5 ]]
==================
[[ .5 ]]
---
(script
	(inlineRoll
		(delimiter_start)
		(formula
			(term
				(decimal_point)
				(number_constant)))
		(delimiter_end)))

