==================
Number: Valid: [[5]]
==================
[[5]]
---
(roll20_script
	(inlineRoll
		(delimiter)
		(number)
		(delimiter)))

==================
Number: Valid: [[55.55]]
==================
[[55.55]]
---
(roll20_script
	(inlineRoll
		(delimiter)
		(number)
		(delimiter)))

==================
Number: Valid: [[5.5]]
==================
[[5.5]]
---
(roll20_script
	(inlineRoll
		(delimiter)
		(number)
		(delimiter)))

==================
Number: Valid: [[ 5.5 ]]
==================
[[ 5.5 ]]
---
(roll20_script
	(inlineRoll
		(delimiter)
		(number)
		(delimiter)))

==================
Number: Valid: [[-5.5]]
==================
[[-5.5]]
---
(roll20_script
	(inlineRoll
		(delimiter)
		(operator)
		(number)
		(delimiter)))

==================
Number: Valid: [[ -5.5 ]]
==================
[[ -5.5 ]]
---
(roll20_script
	(inlineRoll
		(delimiter)
		(operator)
		(number)
		(delimiter)))

==================
Number: Valid: [[+5]]
==================
[[+5]]
---
(roll20_script
	(inlineRoll
		(delimiter)
		(operator)
		(number)
		(delimiter)))

==================
Number: Valid: [[ +5 ]]
==================
[[ +5 ]]
---
(roll20_script
	(inlineRoll
		(delimiter)
		(operator)
		(number)
		(delimiter)))

==================
Number: Valid: [[.5]]
==================
[[.5]]
---
(roll20_script
	(inlineRoll
		(delimiter)
		(number)
		(delimiter)))

==================
Number: Valid: [[ .5 ]]
==================
[[ .5 ]]
---
(roll20_script
	(inlineRoll
		(delimiter)
		(number)
		(delimiter)))

==================
Number: Invalid: [[-.5]]
==================
[[-.5]]
---
(roll20_script
	(inlineRoll
		(delimiter)
		(invalid
			(operator))
		(delimiter)))

==================
Number: Invalid: [[ -.5 ]]
==================
[[ -.5 ]]
---
(roll20_script
	(inlineRoll
		(delimiter)
		(invalid
			(operator))
		(delimiter)))

==================
Number: Valid with Invalid Remainder: [[5_]]
==================
[[5_]]
---
(roll20_script
	(inlineRoll
		(delimiter)
		(number)
		(invalid)
		(delimiter)))

==================
Number: Valid with Invalid Remainder: [[ 5_ ]]
==================
[[ 5_ ]]
---
(roll20_script
	(inlineRoll
		(delimiter)
		(number)
		(invalid)
		(delimiter)))

==================
Number: Valid with Invalid Remainder: [[-5_]]
==================
[[-5_]]
---
(roll20_script
	(inlineRoll
		(delimiter)
		(operator)
		(number)
		(invalid)
		(delimiter)))

==================
Number: Valid with Invalid Remainder: [[ -5_ ]]
==================
[[ -5_ ]]
---
(roll20_script
	(inlineRoll
		(delimiter)
		(operator)
		(number)
		(invalid)
		(delimiter)))

==================
Number: Valid with Invalid Remainder: [[5.]]
==================
[[5.]]
---
(roll20_script
	(inlineRoll
		(delimiter)
		(number)
		(invalid)
		(delimiter)))

==================
Number: Valid with Invalid Remainder: [[ 5. ]]
==================
[[ 5. ]]
---
(roll20_script
	(inlineRoll
		(delimiter)
		(number)
		(invalid)
		(delimiter)))

==================
Number: Valid with Invalid Remainder: [[-5.]]
==================
[[-5.]]
---
(roll20_script
	(inlineRoll
		(delimiter)
		(operator)
		(number)
		(invalid)
		(delimiter)))

==================
Number: Valid with Invalid Remainder: [[ -5. ]]
==================
[[ -5. ]]
---
(roll20_script
	(inlineRoll
		(delimiter)
		(operator)
		(number)
		(invalid)
		(delimiter)))

==================
Number: Valid with Invalid Remainder: [[5._]]
==================
[[5._]]
---
(roll20_script
	(inlineRoll
		(delimiter)
		(number)
		(invalid)
		(delimiter)))

==================
Number: Valid with Invalid Remainder: [[ 5._ ]]
==================
[[ 5._ ]]
---
(roll20_script
	(inlineRoll
		(delimiter)
		(number)
		(invalid)
		(delimiter)))

==================
Number: Valid with Invalid Remainder: [[-5._]]
==================
[[-5._]]
---
(roll20_script
	(inlineRoll
		(delimiter)
		(operator)
		(number)
		(invalid)
		(delimiter)))

==================
Number: Valid with Invalid Remainder: [[ -5._ ]]
==================
[[ -5._ ]]
---
(roll20_script
	(inlineRoll
		(delimiter)
		(operator)
		(number)
		(invalid)
		(delimiter)))

==================
Number: Valid with Invalid Remainder: [[5.5.]]
==================
[[5.5.]]
---
(roll20_script
	(inlineRoll
		(delimiter)
		(number)
		(invalid)
		(delimiter)))

==================
Number: Valid with Invalid Remainder: [[5.5_]]
==================
[[5.5_]]
---
(roll20_script
	(inlineRoll
		(delimiter)
		(number)
		(invalid)
		(delimiter)))

==================
Number: Valid with Invalid Remainder: [[-5.5.]]
==================
[[-5.5.]]
---
(roll20_script
	(inlineRoll
		(delimiter)
		(operator)
		(number)
		(invalid)
		(delimiter)))

==================
Number: Valid with Invalid Remainder: [[-5.5_]]
==================
[[-5.5_]]
---
(roll20_script
	(inlineRoll
		(delimiter)
		(operator)
		(number)
		(invalid)
		(delimiter)))

==================
Number: Invalid: [[.]]
==================
[[.]]
---
(roll20_script
	(inlineRoll
		(delimiter)
		(invalid)
		(delimiter)))

==================
Number: Invalid: [[ . ]]
==================
[[ . ]]
---
(roll20_script
	(inlineRoll
		(delimiter)
		(invalid)
		(delimiter)))

==================
Number: Invalid: [[-.]]
==================
[[-.]]
---
(roll20_script
	(inlineRoll
		(delimiter)
		(invalid
			(operator))
		(delimiter)))

==================
Number: Invalid: [[ -. ]]
==================
[[ -. ]]
---
(roll20_script
	(inlineRoll
		(delimiter)
		(invalid
			(operator))
		(delimiter)))

==================
Number: Invalid: [[._]]
==================
[[._]]
---
(roll20_script
	(inlineRoll
		(delimiter)
		(invalid)
		(delimiter)))

==================
Number: Invalid: [[ ._ ]]
==================
[[ ._ ]]
---
(roll20_script
	(inlineRoll
		(delimiter)
		(invalid)
		(delimiter)))

==================
Number: Invalid: [[-._]]
==================
[[-._]]
---
(roll20_script
	(inlineRoll
		(delimiter)
		(invalid
			(operator))
		(delimiter)))

==================
Number: Invalid: [[ -._ ]]
==================
[[ -._ ]]
---
(roll20_script
	(inlineRoll
		(delimiter)
		(invalid
			(operator))
		(delimiter)))

==================
Number: Valid with Invalid Remainder: [[5d]]
==================
[[5d]]
---
(roll20_script
 	(inlineRoll
		(delimiter)
		(number)
		(invalid)
		(delimiter)))

==================
Number: Valid with Invalid Remainder: [[5d_]]
==================
[[5d_]]
---
(roll20_script
 	(inlineRoll
		(delimiter)
		(number)
		(invalid)
		(delimiter)))

==================
Number: Valid with Invalid Remainder: [[-5d6]]
==================
[[-5d6]]
---
(roll20_script
 	(inlineRoll
		(delimiter)
		(operator)
		(number)
		(invalid)
		(delimiter)))

==================
Inline Roll: Valid: [[5d6]]
==================
[[5d6]]
---
(roll20_script
 	(inlineRoll
		(delimiter)
		(diceRoll
			(count
				(number))
			(delimiter)
			(sides
				(number)))
		(delimiter)))

==================
Inline Roll: Valid: [[5.5.5]]
==================
[[5.5.5]]
---
(roll20_script
 	(inlineRoll
		(delimiter)
		(number)
		(invalid)
		(delimiter)))

