==================
Inline Roll: [[5]]
==================
[[5]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(number)
		)
	) (delimiter)))

==================
Inline Roll: [[ 5 ]]
==================
[[ 5 ]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(number)
		)
	) (delimiter)))






==================
Inline Roll: [[-5]]
==================
[[-5]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(operator)
			(number)
		)
	) (delimiter)))

==================
Inline Roll: [[ -5 ]]
==================
[[ -5 ]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(operator)
			(number)
		)
	) (delimiter)))

==================
Inline Roll: [[+5]]
==================
[[+5]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(operator)
			(number)
		)
	) (delimiter)))






==================
Inline Roll: [[1-5]]
==================
[[1-5]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(number)
		)
		(operator)
		(term
			(number)
		)
	) (delimiter)))

==================
Inline Roll: [[1 - 5]]
==================
[[1 - 5]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(number)
		)
		(operator)
		(term
			(number)
		)
	) (delimiter)))

==================
Inline Roll: [[1+5]]
==================
[[1+5]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(number)
		)
		(operator)
		(term
			(number)
		)
	) (delimiter)))

==================
Inline Roll: [[1 + 5]]
==================
[[1 + 5]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(number)
		)
		(operator)
		(term
			(number)
		)
	) (delimiter)))

==================
Inline Roll: [[1*5]]
==================
[[1*5]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(number)
		)
		(operator)
		(term
			(number)
		)
	) (delimiter)))

==================
Inline Roll: [[1 * 5]]
==================
[[1 * 5]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(number)
		)
		(operator)
		(term
			(number)
		)
	) (delimiter)))

==================
Inline Roll: [[1**5]]
==================
[[1**5]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(number)
		)
		(operator)
		(term
			(number)
		)
	) (delimiter)))

==================
Inline Roll: [[1 ** 5]]
==================
[[1 ** 5]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(number)
		)
		(operator)
		(term
			(number)
		)
	) (delimiter)))

==================
Inline Roll: [[1/5]]
==================
[[1/5]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(number)
		)
		(operator)
		(term
			(number)
		)
	) (delimiter)))

==================
Inline Roll: [[1 / 5]]
==================
[[1 / 5]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(number)
		)
		(operator)
		(term
			(number)
		)
	) (delimiter)))

==================
Inline Roll: [[1%5]]
==================
[[1%5]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(number)
		)
		(operator)
		(term
			(number)
		)
	) (delimiter)))

==================
Inline Roll: [[1 % 5]]
==================
[[1 % 5]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(number)
		)
		(operator)
		(term
			(number)
		)
	) (delimiter)))

==================
Inline Roll: [[1+-5]]
==================
[[1+-5]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(number)
		)
		(operator)
		(term
			(number)
		)
	) (delimiter)))

==================
Inline Roll: [[1 + - 5]]
==================
[[1 + - 5]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(number)
		)
		(operator)
		(term
			(number)
		)
	) (delimiter)))

==================
Inline Roll: [[1-+5]]
==================
[[1-+5]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(number)
		)
		(operator)
		(term
			(number)
		)
	) (delimiter)))

==================
Inline Roll: [[1 - + 5]]
==================
[[1 - + 5]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(number)
		)
		(operator)
		(term
			(number)
		)
	) (delimiter)))

==================
Inline Roll: [[1+-+5]]
==================
[[1+-+5]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(number)
		)
		(operator)
		(term
			(number)
		)
	) (delimiter)))

==================
Inline Roll: [[1-+-5]]
==================
[[1-+-5]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(number)
		)
		(operator)
		(term
			(number)
		)
	) (delimiter)))

==================
Inline Roll: [[1+ - + -+ -+-5]]
==================
[[1+ - + -+ -+-5]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(number)
		)
		(operator)
		(term
			(number)
		)
	) (delimiter)))

==================
Inline Roll: [[1 / + - + -+ -+-5]]
==================
[[1 / + - + -+ -+-5]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(number)
		)
		(operator)
		(operator)
		(term
			(number)
		)
	) (delimiter)))






==================
Inline Roll: [[@{a}]]
==================
[[@{a}]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(attribute (delimiter)
				(name) (delimiter))
		)
	) (delimiter)))

==================
Inline Roll: [[ @{a} ]]
==================
[[ @{a} ]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(attribute (delimiter)
				(name) (delimiter))
		)
	) (delimiter)))

==================
Inline Roll: [[@{c|a}]]
==================
[[@{c|a}]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(attribute (delimiter)
				(character) (delimiter)
				(name) (delimiter))
		)
	) (delimiter)))

==================
Inline Roll: [[%{a}]]
==================
[[%{a}]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(ability (delimiter)
				(name) (delimiter))
		)
	) (delimiter)))

==================
Inline Roll: [[ %{a} ]]
==================
[[ %{a} ]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(ability (delimiter)
				(name) (delimiter))
		)
	) (delimiter)))

==================
Inline Roll: [[%{c|a}]]
==================
[[%{c|a}]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(ability (delimiter)
				(character) (delimiter)
				(name) (delimiter))
		)
	) (delimiter)))






==================
Inline Roll: [[#m]]
==================
[[#m]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(macroHash)
		)
	) (delimiter)))

==================
Inline Roll: [[#m ]]
==================
[[#m ]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(macro (delimiter) (name))
		)
	) (delimiter)))

==================
Inline Roll: [[ #m]]
==================
[[ #m]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(macroHash)
		)
	) (delimiter)))

==================
Inline Roll: [[ #m ]]
==================
[[ #m ]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(macro (delimiter) (name))
		)
	) (delimiter)))

==================
Inline Roll: [[#m ]]@{a}]]
==================
[[#m ]]@{a}]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(macro (delimiter) (name))
		)
	) (delimiter))
	(attribute (delimiter)
		(name) (delimiter)))

==================
Inline Roll: [[#m]]@{a}]]
==================
[[#m]]@{a}]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(macroHash)
		)
	) (delimiter))
	(attribute (delimiter)
		(name) (delimiter)))






==================
Inline Roll: [[ [[5]] ]]
==================
[[ [[5]] ]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(inlineRoll (delimiter) (formula
				(term
					(number)
				)
			) (delimiter))
		)
	) (delimiter)))


==================
Inline Roll: [[ @{a}[[5]]%{b} ]]
==================
[[ @{a}[[5]]%{b} ]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(attribute (delimiter)
				(name) (delimiter))
			(inlineRoll (delimiter) (formula
				(term
					(number)
				)
			) (delimiter))
			(ability (delimiter)
				(name) (delimiter))
		)
	) (delimiter)))

==================
Inline Roll: [[ -@{a}[[5]]%{b} ]]
==================
[[ -@{a}[[5]]%{b} ]]
---
(script
	(inlineRoll (delimiter) (formula
		(term
			(operator)
			(attribute (delimiter)
				(name) (delimiter))
			(inlineRoll (delimiter) (formula
				(term
					(number)
				)
			) (delimiter))
			(ability (delimiter)
				(name) (delimiter))
		)
	) (delimiter)))
